Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/local_authority_and_social_housing/joint_tenancy_relationship_breakdown.html.txt.tmx
Source language: en
Languages: ga

source: Joint tenancy and relationship breakdown
ga: Tionóntacht chomhpháirtíoch agus cliseadh caidrimh

source: If you have a joint tenancy and your relationship with your joint tenant has broken down and he/she has left the home, you will probably want his/her name removed from the tenancy agreement with the local authority or housing association
ga: Má tá tú i thionóntacht chomhpháirtíoch agus má bhriseann ar an gcaidreamh idir tú féin agus an tionónta eile sa teach, fágann sé/sí an teach, is dócha gur mhaith leat ainm an duine eile a bhaint den chonradh tionóntachta

source: One of the factors considered in a judicial separation, divorce or dissolution is occupation of the family/shared home
ga: Má aontaíonn do chomhpháirtí a ainm a bhaint den chonradh tionóntachta, déanfaidh an cumann tithíochta nó an t-údarás áitiúil é seo

source: The judge can order a transfer of tenancy. If you are in a situation where a relationship is breaking down, you should seek legal advice
ga: Ar an taobh eile, má dhiúltaíonn sé a ainm a scriosadh, beidh sé níos casta agus caithfidh tú a chruthú go bhfuil an caidreamh briste síos

source: If you are left living alone in the family home, the local authority or housing association may consider that your house is too big for you and offer you alternative accommodation, unless you can argue that you have occasional custody of your children and need somewhere for them to stay. If you have left the family home and removed your name from the joint tenancy agreement, you can apply to the local authority for accommodation
ga: Más páirtí tú atá i do chonaí i d'aonar sa teach baile, agus má cheapann an cumann tithíochta nó an t-údarás áitiúil go bhfuil do theach ró-mhór do do riachtanais, is féidir leo malairt tí a thabhairt duit, muna bhfuil tú in ann a chruthú dóibh go bhfuil cúram na leanaí ort anois agus arís agus go dteastaíonn áit chónaithe uathu

source: Contact the Housing Department of your local authority or housing association
ga: Téigh i dteagmháil le d' údarás áitiúil nó le do chumann tithíochta
